""" Приложение Task Manager
    =============================================================
        консольное приложение - менеджер управления заметок,
        пользователь может создать заметку, редактировать,
        посмотреть все заметки или удалить выбранную.
    =============================================================
    ~~~~~~~~~~~~~~~~~~~~~
    | version app 0.0.7 |
    ~~~~~~~~~~~~~~~~~~~~~

    v(0.0.1)
    разработан цикл приложения - структурное программирование

    v(0.0.2)
    внедрен  i/o функционал для ввода задачи

    v(0.0.3)
    разработаны функции для цикла - функциональное программирование

    v(0.0.4)
    добавлены проверки и подтверждения

    v(0.0.5)
    созданы методы сохранения и загрузки - файловые сохранения

    v(0.0.6)
    созданы методы для удаления, редактирования и создания задач - логика вынесена из цикла

    v(0.0.7)
    основной цикл помещен в отдельный метод - def main

    v(0.0.8)
    реализован функционал добавления контента задачи - имя + содержание

    v(0.0.9)
    разгрупперовка по модулям, тестирование всего функционала

    v(0.1.0)
    добавлены методы самоопределения приложения, разработана документация, выполнена сборка

    v(0.1.1)
    архетектурная коррекция - модули в src по директориям, создание первичного gui

    v(0.1.2)
    создание основных методов view модуля с взаимодействиями через tkinter

    v(0.1.3)
    создание кастомных компонентов - AppButton

"""

import view


def main():
    view.run()


if __name__ == "__main__":
    main()


